# Creating Database

In [1]:
%load_ext sql
#% is python magic command

In [2]:
%sql sqlite://
#sql is not case-sensitive

### How to Create Table

In [3]:
%%sql CREATE TABLE rep (
REP_NUM CHAR(2) PRIMARY KEY,
LAST_NAME CHAR(15),
FIRST_NAME CHAR(15),
STATE CHAR(2),
ZIP CHAR(5),
COMMISION DECIMAL(7,2),
RATE DECIMAL(3,2) 
);

 * sqlite://
Done.

[]

### How to modify existing table

In [4]:
%sql DROP TABLE rep;

 * sqlite://
Done.

[]

In [5]:
%%sql CREATE TABLE rep (
REP_NUM CHAR(2) PRIMARY KEY,
LAST_NAME CHAR(15) NOT NULL,
FIRST_NAME CHAR(15) NOT NULL,
STREET CHAR(15),
CITY CHAR(15),
STATE CHAR(2),
ZIP CHAR(5),
COMMISION DECIMAL(7,2),
RATE DECIMAL(3,2) 
);

 * sqlite://
Done.

[]

### Pulling/ Displaying a Table

In [6]:
%sql SELECT * FROM REP;

 * sqlite://
Done.

[]

In [7]:
%%sql
INSERT INTO rep
VALUES
('20', 'Kaiser', 'Valerie', '624 Randall', 'Grove', 'FL', '33321', 2042.50, 0.05)

 * sqlite://
1 rows affected.

[]

In [8]:
%sql SELECT * FROM rep;

 * sqlite://
Done.

[('20', 'Kaiser', 'Valerie', '624 Randall', 'Grove', 'FL', '33321', 2042.5, 0.05)]

In [9]:
# ; seperates commands

### Inserting a row that contains null values

In [10]:
%sql INSERT INTO rep (REP_NUM, LAST_NAME, FIRST_NAME) VALUES ('85', 'Webb', 'Tina');

 * sqlite://
1 rows affected.

[]

In [11]:
%sql SELECT * FROM rep;

 * sqlite://
Done.

[('20', 'Kaiser', 'Valerie', '624 Randall', 'Grove', 'FL', '33321', 2042.5, 0.05),
 ('85', 'Webb', 'Tina', None, None, None, None, None, None)]

In [12]:
%%sql
INSERT INTO rep
VALUES
('35', 'Hull', 'Richard', '532 Jackson', 'Sheldon', 'FL', '33553', 39216, 0.07),
('65', 'Perez', 'Juan', '1626 Taylor', 'Filmore', 'FL', '33336', 23487, 0.05);

 * sqlite://
2 rows affected.

[]

### Update Records

In [13]:
%%sql 
UPDATE rep
SET last_name = 'Perry'
WHERE rep_num = '85';

 * sqlite://
1 rows affected.

[]

In [14]:
%sql SELECT * FROM rep;

 * sqlite://
Done.

[('20', 'Kaiser', 'Valerie', '624 Randall', 'Grove', 'FL', '33321', 2042.5, 0.05),
 ('85', 'Perry', 'Tina', None, None, None, None, None, None),
 ('35', 'Hull', 'Richard', '532 Jackson', 'Sheldon', 'FL', '33553', 39216, 0.07),
 ('65', 'Perez', 'Juan', '1626 Taylor', 'Filmore', 'FL', '33336', 23487, 0.05)]

### Deleting Records

In [15]:
%sql DELETE FROM rep WHERE rep_num = '85'

 * sqlite://
1 rows affected.

[]

In [16]:
%sql SELECT * FROM rep;

 * sqlite://
Done.

[('20', 'Kaiser', 'Valerie', '624 Randall', 'Grove', 'FL', '33321', 2042.5, 0.05),
 ('35', 'Hull', 'Richard', '532 Jackson', 'Sheldon', 'FL', '33553', 39216, 0.07),
 ('65', 'Perez', 'Juan', '1626 Taylor', 'Filmore', 'FL', '33336', 23487, 0.05)]

### Creating The Remaining Database

In [17]:
%%sql
CREATE TABLE CUSTOMER
(CUSTOMER_NUM CHAR(3) PRIMARY KEY,
CUSTOMER_NAME CHAR(35) NOT NULL,
STREET CHAR(15),
CITY CHAR(15),
STATE CHAR(2),
ZIP CHAR(5),
BALANCE DECIMAL(8,2),
CREDIT_LIMIT DECIMAL(8,2),
REP_NUM CHAR(2) );

 * sqlite://
Done.

[]

In [18]:
%%sql
INSERT INTO CUSTOMER
VALUES
('148','Al''s Appliance and Sport','2837 Greenway','Fillmore','FL','33336',6550.00,7500.00,'20'),
('282','Brookings Direct','3827 Devon','Grove','FL','33321',431.50,10000.00,'35'),
('356','Ferguson''s','382 Wildwood','Northfield','FL','33146',5785.00,7500.00,'65'),
('408','The Everything Shop','1828 Raven','Crystal','FL','33503',5285.25,5000.00,'35'),
('462','Bargains Galore','3829 Central','Grove','FL','33321',3412.00,10000.00,'65'),
('524','Kline''s','838 Ridgeland','Fillmore','FL','33336',12762.00,15000.00,'20'),
('608','Johnson''s Department Store','372 Oxford','Sheldon','FL','33553',2106.00,10000.00,'65'),
('687','Lee''s Sport and Appliance','282 Evergreen','Altonville','FL','32543',2851.00,5000.00,'35'),
('725','Deerfield''s Four Seasons','282 Columbia','Sheldon','FL','33553',248.00,7500.00,'35'),
('842','All Season','28 Lakeview','Grove','FL','33321',8221.00,7500.00,'20');

 * sqlite://
10 rows affected.

[]

In [19]:
%sql SELECT * FROM CUSTOMER

 * sqlite://
Done.

[('148', "Al's Appliance and Sport", '2837 Greenway', 'Fillmore', 'FL', '33336', 6550, 7500, '20'),
 ('282', 'Brookings Direct', '3827 Devon', 'Grove', 'FL', '33321', 431.5, 10000, '35'),
 ('356', "Ferguson's", '382 Wildwood', 'Northfield', 'FL', '33146', 5785, 7500, '65'),
 ('408', 'The Everything Shop', '1828 Raven', 'Crystal', 'FL', '33503', 5285.25, 5000, '35'),
 ('462', 'Bargains Galore', '3829 Central', 'Grove', 'FL', '33321', 3412, 10000, '65'),
 ('524', "Kline's", '838 Ridgeland', 'Fillmore', 'FL', '33336', 12762, 15000, '20'),
 ('608', "Johnson's Department Store", '372 Oxford', 'Sheldon', 'FL', '33553', 2106, 10000, '65'),
 ('687', "Lee's Sport and Appliance", '282 Evergreen', 'Altonville', 'FL', '32543', 2851, 5000, '35'),
 ('725', "Deerfield's Four Seasons", '282 Columbia', 'Sheldon', 'FL', '33553', 248, 7500, '35'),
 ('842', 'All Season', '28 Lakeview', 'Grove', 'FL', '33321', 8221, 7500, '20')]

In [20]:
%%sql
CREATE TABLE ORDERS
(ORDER_NUM CHAR(5) PRIMARY KEY,
ORDER_DATE DATE,
CUSTOMER_NUM CHAR(3) );

 * sqlite://
Done.

[]

In [21]:
%%sql
INSERT INTO ORDERS
VALUES
('21608','20-OCT-2010','148'),
('21610','20-OCT-2010','356'),
('21613','21-OCT-2010','408'),
('21614','21-OCT-2010','282'),
('21617','23-OCT-2010','608'),
('21619','23-OCT-2010','148'),
('21623','23-OCT-2010','608');

 * sqlite://
7 rows affected.

[]

In [22]:
%sql SELECT * FROM ORDERS

 * sqlite://
Done.

[('21608', '20-OCT-2010', '148'),
 ('21610', '20-OCT-2010', '356'),
 ('21613', '21-OCT-2010', '408'),
 ('21614', '21-OCT-2010', '282'),
 ('21617', '23-OCT-2010', '608'),
 ('21619', '23-OCT-2010', '148'),
 ('21623', '23-OCT-2010', '608')]

In [23]:
%%sql
CREATE TABLE PART
(PART_NUM CHAR(4) PRIMARY KEY,
DESCRIPTION CHAR(15),
ON_HAND DECIMAL(4,0),
CLASS CHAR(2),
WAREHOUSE CHAR(1),
PRICE DECIMAL(6,2) );

 * sqlite://
Done.

[]

In [24]:
%%sql
INSERT INTO PART VALUES
('AT94','Iron',50,'HW','3',24.95),
('BV06','Home Gym',45,'SG','2',794.95),
('CD52','Microwave Oven',32,'AP','1',165.00),
('DL71','Cordless Drill',21,'HW','3',129.95),
('DR93','Gas Range',8,'AP','2',495.00),
('DW11','Washer',12,'AP','3',399.99),
('FD21','Stand Mixer',22,'HW','3',159.95),
('KL62','Dryer',12,'AP','1',349.95),
('KT03','Dishwasher',8,'AP','3',595.00),
('KV29','Treadmill',9,'SG','2',1390.00);

 * sqlite://
10 rows affected.

[]

In [25]:
%sql SELECT * FROM PART

 * sqlite://
Done.

[('AT94', 'Iron', 50, 'HW', '3', 24.95),
 ('BV06', 'Home Gym', 45, 'SG', '2', 794.95),
 ('CD52', 'Microwave Oven', 32, 'AP', '1', 165),
 ('DL71', 'Cordless Drill', 21, 'HW', '3', 129.95),
 ('DR93', 'Gas Range', 8, 'AP', '2', 495),
 ('DW11', 'Washer', 12, 'AP', '3', 399.99),
 ('FD21', 'Stand Mixer', 22, 'HW', '3', 159.95),
 ('KL62', 'Dryer', 12, 'AP', '1', 349.95),
 ('KT03', 'Dishwasher', 8, 'AP', '3', 595),
 ('KV29', 'Treadmill', 9, 'SG', '2', 1390)]

In [26]:
%%sql
CREATE TABLE ORDER_LINE
(ORDER_NUM CHAR(5),
PART_NUM CHAR(4),
NUM_ORDERED DECIMAL(3,0),
QUOTED_PRICE DECIMAL(6,2),
PRIMARY KEY (ORDER_NUM, PART_NUM) );

 * sqlite://
Done.

[]

In [27]:
%%sql
INSERT INTO ORDER_LINE VALUES
('21608','AT94',11,21.95),
('21610','DR93',1,495.00),
('21610','DW11',1,399.99),
('21613','KL62',4,329.95),
('21614','KT03',2,595.00),
('21617','BV06',2,794.95),
('21617','CD52',4,150.00),
('21619','DR93',1,495.00),
('21623','KV29',2,1290.00);

 * sqlite://
9 rows affected.

[]

### Displaying Tables

In [28]:
%%sql
SELECT * FROM REP;

 * sqlite://
Done.

[('20', 'Kaiser', 'Valerie', '624 Randall', 'Grove', 'FL', '33321', 2042.5, 0.05),
 ('35', 'Hull', 'Richard', '532 Jackson', 'Sheldon', 'FL', '33553', 39216, 0.07),
 ('65', 'Perez', 'Juan', '1626 Taylor', 'Filmore', 'FL', '33336', 23487, 0.05)]

In [29]:
%%sql
SELECT * FROM CUSTOMER;

 * sqlite://
Done.

[('148', "Al's Appliance and Sport", '2837 Greenway', 'Fillmore', 'FL', '33336', 6550, 7500, '20'),
 ('282', 'Brookings Direct', '3827 Devon', 'Grove', 'FL', '33321', 431.5, 10000, '35'),
 ('356', "Ferguson's", '382 Wildwood', 'Northfield', 'FL', '33146', 5785, 7500, '65'),
 ('408', 'The Everything Shop', '1828 Raven', 'Crystal', 'FL', '33503', 5285.25, 5000, '35'),
 ('462', 'Bargains Galore', '3829 Central', 'Grove', 'FL', '33321', 3412, 10000, '65'),
 ('524', "Kline's", '838 Ridgeland', 'Fillmore', 'FL', '33336', 12762, 15000, '20'),
 ('608', "Johnson's Department Store", '372 Oxford', 'Sheldon', 'FL', '33553', 2106, 10000, '65'),
 ('687', "Lee's Sport and Appliance", '282 Evergreen', 'Altonville', 'FL', '32543', 2851, 5000, '35'),
 ('725', "Deerfield's Four Seasons", '282 Columbia', 'Sheldon', 'FL', '33553', 248, 7500, '35'),
 ('842', 'All Season', '28 Lakeview', 'Grove', 'FL', '33321', 8221, 7500, '20')]

In [30]:
%%sql
SELECT * FROM ORDERS;

 * sqlite://
Done.

[('21608', '20-OCT-2010', '148'),
 ('21610', '20-OCT-2010', '356'),
 ('21613', '21-OCT-2010', '408'),
 ('21614', '21-OCT-2010', '282'),
 ('21617', '23-OCT-2010', '608'),
 ('21619', '23-OCT-2010', '148'),
 ('21623', '23-OCT-2010', '608')]

In [31]:
%%sql
SELECT * FROM ORDER_LINE;

 * sqlite://
Done.

[('21608', 'AT94', 11, 21.95),
 ('21610', 'DR93', 1, 495),
 ('21610', 'DW11', 1, 399.99),
 ('21613', 'KL62', 4, 329.95),
 ('21614', 'KT03', 2, 595),
 ('21617', 'BV06', 2, 794.95),
 ('21617', 'CD52', 4, 150),
 ('21619', 'DR93', 1, 495),
 ('21623', 'KV29', 2, 1290)]

In [32]:
%%sql
SELECT * FROM PART;

 * sqlite://
Done.

[('AT94', 'Iron', 50, 'HW', '3', 24.95),
 ('BV06', 'Home Gym', 45, 'SG', '2', 794.95),
 ('CD52', 'Microwave Oven', 32, 'AP', '1', 165),
 ('DL71', 'Cordless Drill', 21, 'HW', '3', 129.95),
 ('DR93', 'Gas Range', 8, 'AP', '2', 495),
 ('DW11', 'Washer', 12, 'AP', '3', 399.99),
 ('FD21', 'Stand Mixer', 22, 'HW', '3', 159.95),
 ('KL62', 'Dryer', 12, 'AP', '1', 349.95),
 ('KT03', 'Dishwasher', 8, 'AP', '3', 595),
 ('KV29', 'Treadmill', 9, 'SG', '2', 1390)]

## A. Warm-up SQL Fundamentals

A.1. List the names of all customers that have a credit limit of $7,500 or less.

In [33]:
%%sql
SELECT customer_name
FROM customer
WHERE credit_limit <= 7500;

 * sqlite://
Done.

[("Al's Appliance and Sport",),
 ("Ferguson's",),
 ('The Everything Shop',),
 ("Lee's Sport and Appliance",),
 ("Deerfield's Four Seasons",),
 ('All Season',)]

A.2. List the order numbers for orders placed by customer number 608 on 10/23/2010.

In [36]:
%%sql
SELECT order_num
FROM orders
WHERE customer_num = '608' AND order_date = '23-OCT-2010';

 * sqlite://
Done.

[('21617',), ('21623',)]

A.3. List the part number and part description of all parts that are in item class HW.

In [37]:
%%sql 
SELECT part_num, description
FROM part
WHERE class = 'HW';

 * sqlite://
Done.

[('AT94', 'Iron'), ('DL71', 'Cordless Drill'), ('FD21', 'Stand Mixer')]

A.4. List the part number, part description, and on-hand value for each part in item class SG. (Hint: On-hand value is the result of multiplying the number of units on hand by the price.)

In [41]:
%%sql 
SELECT part_num, description, on_hand * price AS ON_HAND_VALUE
FROM part
WHERE class = 'SG';

 * sqlite://
Done.

[('BV06', 'Home Gym', 35772.75), ('KV29', 'Treadmill', 12510)]

A.5. How many customers have a balance that exceeds their credit limit?

In [43]:
%%sql
SELECT COUNT(customer_name) AS NUMBER_OF_CUSTOMERS
FROM customer
WHERE credit_limit < balance;

 * sqlite://
Done.

[(2,)]

A.6. What is the part number, description, and price of the least expensive part in the database?

In [44]:
%%sql
SELECT *
FROM part
ORDER BY price ASC
LIMIT 1;

 * sqlite://
Done.

[('AT94', 'Iron', 50, 'HW', '3', 24.95)]

A.7. For each order, list the order number, order date, customer number, and customer name.

In [51]:
%%sql
SELECT order_num, order_date, orders.customer_num, customer_name
FROM orders
LEFT JOIN customer
ON orders.customer_num = customer.customer_num;

 * sqlite://
Done.

[('21608', '20-OCT-2010', '148', "Al's Appliance and Sport"),
 ('21610', '20-OCT-2010', '356', "Ferguson's"),
 ('21613', '21-OCT-2010', '408', 'The Everything Shop'),
 ('21614', '21-OCT-2010', '282', 'Brookings Direct'),
 ('21617', '23-OCT-2010', '608', "Johnson's Department Store"),
 ('21619', '23-OCT-2010', '148', "Al's Appliance and Sport"),
 ('21623', '23-OCT-2010', '608', "Johnson's Department Store")]

A.8. For each order placed on October 21, 2010, list the order number, customer number, and customer name.

In [54]:
%%sql
SELECT order_num, orders.customer_num, customer_name
FROM orders
LEFT JOIN customer
ON orders.customer_num = customer.customer_num
WHERE order_date = '21-OCT-2010';

 * sqlite://
Done.

[('21613', '408', 'The Everything Shop'), ('21614', '282', 'Brookings Direct')]

A.9. For each order placed on October 21, 2010, list the order number, part number, part description, and item class for each part ordered.

In [59]:
%%sql
SELECT orders.order_num, order_line.part_num, part.description, part.class
FROM orders
LEFT JOIN order_line
ON orders.order_num = order_line.order_num
LEFT JOIN part
ON part.part_num = order_line.part_num
WHERE order_date = '21-OCT-2010';

 * sqlite://
Done.

[('21613', 'KL62', 'Dryer', 'AP'), ('21614', 'KT03', 'Dishwasher', 'AP')]

## B. Database Design

B. By writing SQL commands for the necessary changes only (i.e., we assume all other commands are given as in the Premier Products database that we created in class and you only need to create the new/modified tables as discussed below) support the following requirements.

Hint: To avoid conflicts with existing tables, simply number the new tables by appending the question number, e.g., for part 1 of this question name the customer table customer1.

Hint 2: As figures that you include into the Jupyter notebook using img src="E-R.png" are not saved with the notebook but remain links to exernal files, please submit your figures in an additional document.

B.1. A customer is not necessarily represented by a single sales rep, but can be represented by several sales reps. When a customer places an order, the sales rep who gets the commission on the order must be in the collection of sales reps who represent the customer. Draw an E-R diagram for the new design and write SQL commands to create tables that are different from the existing tables only.

B.2. There is no relationship between customers and sales reps. When a customer places an order, any sales rep can process the order. On the order, you need to identify both the customer placing the order and the sales rep responsible for the order. Draw an E-R diagram for the new design and write SQL commands to create tables that are different from the existing tables only.

B.3. Using your knowledge of Premiere Products, determine the functional dependencies that exist in the following table. After determining the functional dependencies, convert this table to an equivalent collection of tables that are in third normal form. PART (PART_NUM, DESCRIPTION, ON_HAND, CLASS, WAREHOUSE, PRICE, (ORDER_NUM, ORDER_DATE, CUSTOMER_NUM, CUSTOMER_NAME, NUM_ORDERED, QUOTED_PRICE) )
PART_NUM is the primary key of this table. The highlighted text indicates repeating groups, i.e., each part occurs in “many” orders for which we record the order number, date, customer number and so forth.
Draw an E-R diagram and write SQL commands that create the collection of tables in 3NF.

## C. Fundamental SQL

C.1. List the number and name of each customer represented by sales rep 35 or sales rep 65.

C.2. List the part number and part description of each part that is not in item class AP.

C.3. List the part number, description, and number of units on hand for each part that has
between 10 and 25 units on hand, including both 10 and 25. Do this in different two ways.

C.4. Use the IN operator to list the part number and part description of each part in item class AP or SG.

C.5. Find the number and name of each customer whose name begins with the letter “B.”

C.6. List all details about all parts. Order the output by part description.

C.7. List all details about all parts. Order the output by part number within warehouse. (That is, order the output by warehouse and then by part number.)

C.8. List the part number, part description, and on-hand value of each part whose number of units on hand is more than the average number of units on hand for all parts. (Hint: Use a subquery.)
C.9. List the sum of the balances of all customers for each sales rep. Order and group the results by sales rep number.

C.10. List the sum of the balances of all customers for each sales rep, but restrict the output to those sales reps for which the sum is more than $10,000. Order the results by sales rep number.

C.11. List the part number of any part with an unknown description.

# D. More Advanced SQL

D.1. For each order, list the order number and order date along with the number and name of the customer that placed the order.

D.2. For each order placed on October 23, 2010, list the order number along with the number and name of the customer that

D.2. For each order placed on October 23, 2010, list the order number along with the number and name of the customer that placed the order.

D.3. For each order, list the order number, order date, part number, number of units ordered, and quoted price for each order line that makes up the order.

D.4. Use the IN operator to find the number and name of each customer that placed an order on October 23, 2010.

D.5. Repeat Exercise 4, but this time use the EXISTS operator in your answer.

D.6. Find the number and name of each customer that did not place an order on October 23, 2010.

D.7. For each order, list the order number, order date, part number, part description, and item class for each part that makes up the order.

D.8. Repeat Exercise 7, but this time order the rows by item class and then by order number.

D.9. Use a subquery to find the rep number, last name, and first name of each sales rep who represents at least one customer with a credit limit of $10,000. List each sales rep only once in the results.

D.10. Repeat Exercise 9, but this time do not use a subquery.

D.11. Find the number and name of each customer that currently has an order on file for a
Gas Range.

D.12. List the part number, part description, and item class for each pair of parts that are in the same item class. (For example, one such pair would be part AT94 and part FD21, because the item class for both parts is HW.)

D.13. List the order number and order date for each order placed by the customer named Johnson’s Department Store. (Hint: To enter an apostrophe (single quotation mark) within a string of characters, type two single quotation marks.)

D.14. List the order number and order date for each order that contains an order line for an Iron.

D.15. List the order number and order date for each order that either was placed by Johnson’s Department Store or that contains an order line for a Gas Range.

D.16. List the order number and order date for each order that was placed by Johnson’s Department Store and that contains an order line for a Gas Range.

D.17. List the order number and order date for each order that was placed by Johnson’s Department Store but that does not contain an order line for a Gas Range.

D.18. For each part, list the part number, description, units on hand, order number, and number of units ordered. All parts should be included in the results. For those parts that are currently not on order, the order number and number of units ordered should be left blank (None/NULL/NA). Order the results by part number.